#+title: Ps 07
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-05-03>
#+lastmod: <2026-05-04 07:16>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{mathtools}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t tags:nil
#+property: header-args :eval never-export
#+startup: overview latexpreview inlineimages

*** (c)

#+begin_src julia :results value
using Plots

f(x, y) = log(1 + x + y)
P3(x, y) = (x + y) - 1/2 * (x + y)^2 + 1/3 * (x + y)^3
err(x, y) = f(x, y) - P3(x, y)

xs = 0:0.01:1
ys = 0:0.01:1

cl = (0, P3(1, 1))

p1 = heatmap(xs, ys, f,
             title="f",
             clim=cl,
             aspect_ratio=1,
             c=:viridis)

p2 = heatmap(xs, ys, P3,
             title="P3",
             clim=cl,
             aspect_ratio=1,
             c=:viridis)

p3 = heatmap(xs, ys, err,
             title="f - P3",
             aspect_ratio=1,
             c=cgrad(:reds, rev=true))

p4 = surface(xs, ys, f,
             title="f vs P3",
             c=:viridis,
             alpha=0.7)

surface!(p4, xs, ys, P3,
         c=:viridis,
         alpha=0.7)

plot(p1, p2, p3, p4, layout=(2,2), size=(1200, 1200))

mkpath("./assets")
savefig("./assets/p_01_c.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/mfds/01_bachelor/02_semester/01_analysis/02_exercises/ps_07/assets/p_01_c.png

*** (c)

$f(x,y) = g(x) + g(y)$ with $g(t) = t^4 - 2t^2$, so the gradient separates and each axis evolves independently. Generic starts give $x_k \to \mathrm{sign}(x_0)$, $y_k \to \mathrm{sign}(y_0)$, hence GD converges to a corner $(\pm 1, \pm 1)$. Saddles and the origin require $x_0 = 0$ or $y_0 = 0$ — measure zero.

#+begin_src julia :results value :exports both :tangle julia/p_2.jl
using Plots

f(x, y) = x^4 + y^4 - 2x^2 - 2y^2
∇f(x, y) = [4x^3 - 4x, 4y^3 - 4y]

function gd(x0; η=0.01, N=1000)
    path = zeros(2, N);
    path[:, 1] = x0
    for k in 1:N-1
        path[:, k+1] = path[:, k] .- η .* ∇f(path[1, k], path[2, k])
    end
    return path
end

starts = [[ 1.5,  1.7],
          [-1.5,  1.7],
          [-1.5, -1.7],
          [ 1.5, -1.7],
          [ 1.2,  0.05],
          [-0.05, -1.2],
          [ 1.5,  0.0]]

xs = -2:0.05:2
ys = xs

contour(xs, ys, f, levels=50, c=:viridis, aspect_ratio=1, colorbar=false, size=(800, 800))

for s in starts
    p = gd(s)
    plot!(p[1,:], p[2,:], lw=2, label=false)
    scatter!([p[1,1]],   [p[2,1]],   c=:black, msw=0, label=false)
    scatter!([p[1,end]], [p[2,end]], c=:black, msw=0, label=false)
end

mkpath("./assets")
savefig("./assets/p_02_c.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/mfds/01_bachelor/02_semester/01_analysis/02_exercises/ps_07/assets/p_02_c.png

*** (b) + (c)

#+begin_src julia :results value
# (b)
n = 1000
d = 3
eta = 0.01
N = 50_000
m = 8

t = [i/n for i in 1:n]
A = hcat(ones(n), t, t.^2)
x_true = [1.0, 2.0, 3.0]
b = A * x_true

f(x) = sum((A*x - b).^2) / n

function run_gd()
    x = zeros(d)
    hist = [f(x)]
    for k in 1:N
        grad = (2/n) * sum((A[i,:]'*x - b[i]) * A[i,:] for i in 1:n)
        x = x - eta * grad
        push!(hist, f(x))
    end
    hist
end

function run_sgd()
    x = zeros(d)
    hist = [f(x)]
    for k in 1:N
        i = 1 + (k % n)
        a_i = A[i, :]
        grad = 2 * (a_i' * x - b[i]) * a_i
        x = x - eta * grad
        push!(hist, f(x))
    end
    hist
end

function run_mb()
    x = zeros(d)
    hist = [f(x)]
    for k in 1:N
        indices = [1 + ((k*m + j) % n) for j in 0:m-1]
        A_batch = A[indices, :]
        b_batch = b[indices]
        grad = (2/m) * A_batch' * (A_batch*x - b_batch)
        x = x - eta * grad
        push!(hist, f(x))
    end
    hist
end

hist_gd  = run_gd()
hist_sgd = run_sgd()
hist_mb  = run_mb()

# (c)
using Plots
plot(0:N, hist_gd,  label="GD",  xlabel="iteration k", ylabel="f(x_k)",
     yscale=:log10, lw=2)
plot!(0:N, hist_sgd, label="SGD", lw=2)
plot!(0:N, hist_mb,  label="MB (m=8)", lw=2)

savefig("./assets/p_04_c.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/mfds/01_bachelor/02_semester/01_analysis/02_exercises/ps_07/assets/p_04_c.png

